#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform
data.archive_file.lambda_hello_world: Reading...
data.archive_file.lambda_hello_world: Read complete after 0s [id=a2be94c89c654067a8a307fe4dbad86fdcef1bd7]
aws_sns_topic.notification_topic: Refreshing state... [id=arn:aws:sns:eu-west-1:877118445951:sre-grafana-lambda-notifications]
aws_sqs_queue.dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/877118445951/sre-grafana-lambda-dlq]
aws_iam_role.lambda_role: Refreshing state... [id=sre-grafana-lambda-role]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=sre-grafana-lambda-role-20230408235151866100000001]
aws_cloudwatch_metric_alarm.dlq_alarm: Refreshing state... [id=sre-grafana-lambda-dlq-alarm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role.lambda_role will be destroyed
  # (because aws_iam_role.lambda_role is not in configuration)
  - resource "aws_iam_role" "lambda_role" {
      - arn                   = "arn:aws:iam::877118445951:role/sre-grafana-lambda-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-04-08T23:51:50Z" -> null
      - force_detach_policies = false -> null
      - id                    = "sre-grafana-lambda-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "sre-grafana-lambda-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "ManagedBy" = "Terraform"
          - "Owner"     = "Julia Paiva"
          - "Project"   = "SRE-GRAFANA"
        } -> null
      - unique_id             = "AROA4YOCVLF7VU3RUZUCM" -> null

      - inline_policy {}
    }

  # aws_iam_role.sre-grafana-lambda-role will be created
  + resource "aws_iam_role" "sre-grafana-lambda-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sre-grafana-lambda-role"
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Julia Paiva"
          + "Project"   = "SRE-GRAFANA"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_lambda_function.sre-grafana-lambda will be created
  + resource "aws_lambda_function" "sre-grafana-lambda" {
      + arn                            = (known after apply)
      + filename                       = "lambda_function.py"
      + function_name                  = "lambda_handler"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Y/D+1aWzwenQUcAT6+5sSByU2dUMzTU0F1bmWgpdiMI="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Julia Paiva"
          + "Project"   = "SRE-GRAFANA"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = "arn:aws:sqs:eu-west-1:877118445951:sre-grafana-lambda-dlq"
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @juliavpaiva, Action: `pull_request`, Working Directory: `infrastructure/terraform/main`, Workflow: `Plan Terraform Main`*